[
    [
        {
            "welcome": "Bienvenue",
            "presentation1": "Voici quelques projets réalisé ces dernières années",
            "loading1": "Chargement des photos",
            "loading2": "Entrer"
        }
    ],[
        {
            "name": "4L Trophy",
            "date": "05 - 15 mai 2022",
            "intro": "Raid humanitaire à bord d'une Renault 4L.",
            "description": "Raid à bord d'une 4L pour acheminer des fournitures scolaires et sportives aux enfants du désert. 900 équipages de 2 au départ. 6 000 km parcourus entre la France, l'Espagne et le Maroc. Aventure, mécanique, découverte !",
            "photos": [
                {"type": "img","src": "Trophy/voiture-drapeau.jpg"},
                {"type": "img","src": "Trophy/voiture-moteur.jpg", "desc": "Voiture avant préparation"},
                {"type": "img","src": "Trophy/village-depart.jpg", "desc": "Toutes les voitures au village départ"},
                {"type": "img","src": "Trophy/voiture-desert.jpg"},
                {"type": "img","src": "Trophy/voiture-palmier.jpg"},
                {"type": "img","src": "Trophy/voiture-sable.jpg"},
                {"type": "img","src": "Trophy/circuit.jpg", "desc": "Trajet réalisé, de Angers à Marrakech"}
            ]
        },
        {
            "name": "Stage Citegestion",
            "date": "23 mai - 12 aout 2022",
            "intro": "Développement d'une application web de visualisation de données chez Citegestion, filiale d'EDF.",
            "description": "Le backend de l'application récupère des données en base de données sur le nombre d'interventions par équipement, par jour, par semaine, par mois, etc. Le frontend affiche les données dans un graphique de deux manières différentes : la tendance d'une donnée ou la corrélation entre deux données. L'utilisateur glisse la/les donnée(s) dans des cases pour lancer une analyse. Il peut également choisir la fréquence d'échantillonnage et la plage de dates. Possibilité de tendance simple ou multi-tendance sur la période choisie.",                      
            "outils": [
                {"name": "Flask (Python)"},
                {"name": "VueJs"},
                {"name": "MYSQL"},
                {"name": "Docker"},
                {"name": "GIT"}
            ],
            "outil": "Liste des outils utilisés : ",
            "photos": [
                {"type": "img","src": "StageCitegestion/correlation-light-maquette.jpg", "desc": "Maquette de l'application finale"},
                {"type": "img","src": "StageCitegestion/tendance-light.jpg", "desc": "Application en mode tendance"},
                {"type": "img","src": "StageCitegestion/correlation-dark.jpg", "desc": "Application en mode corrélation"}
            ]
        },
        {
            "name": "Jukebox",
            "date": "septembre 2022 - mai 2023",
            "intro": "Création d'un jukebox en deux parties : une application web pour voir les CD disponibles et en choisir un. Une deuxième partie, une \"machine\" (voir modèle ci-dessous), équipée d'un système de moteurs et d'un électroaimant, qui prend le CD voulu et le place sur le lecteur.",
            "description": "Ce projet regroupe plusieurs domaines, dont le développement web, l'électronique, la mécanique, la modélisation et la gestion de projet. L'application web est prête, une bonne partie du code de gestion des composants est validée. Il me reste à construire la jukebox pour commencer les tests de déplacement, ainsi qu'à tester la partie 'prise' du CD, le placement sur le mur et le lecteur. <br> Le projet est en pause car un stage à l'étranger ne permet pas d'amener le matériel sur place. Une <a href='/jukebox/' target='_blank'>démonstration</a> de l'application est disponible, mais elle n'est pas adaptée aux smartphones car elle sera sur un écran dédié. Vous pouvez changer les CD disponibles en les déplaçant sur la liste à gauche, ou inversement.",
            "photos": [
                {"type": "img","src": "Jukebox/application-frontend.jpg", "desc": "Page principale"},
                {"type": "img","src": "Jukebox/application-frontend-play.jpg", "desc": "Pour lancer un CD"},
                {"type": "img","src": "Jukebox/edit-cd.jpg", "desc": "Editer un CD"},
                {"type": "img","src": "Jukebox/lecteur.jpg", "desc": "Lorsqu'un CD est dans le lecteur"},
                {"type": "img","src": "Jukebox/modelisation-cote.jpg", "desc": "Modelisation de la jukebox"},
                {"type": "img","src": "Jukebox/modelisation-face.jpg"}
            ]    
        },
        {
            "name": "Stage ALC ",
            "date": "06 mars 2023 - 30 juin 2023",
            "intro": "Conception d'une web app de cartographie des acteurs de l'innovation sur Angers Loire Métropole, pour Angers Loire Campus",
            "description": "Durant ce stage, j'ai été le seul développeur, de la création à la mis en ligne de l'application. J'ai tout de même eu un accompagnement sur la partie technique et la partie fonctionnel. L'application regroupe des informations sur le domaine de l'innovation, organisées en catégories contenant des sous-catégories, elles-mêmes contenant des fiches détaillées. Elle intègre une fonctionnalité de gestion de l'application, accessible aux administrateurs (gestion des données et des utilisateurs). La sécurité est assurée grâce à des comptes administrateurs. L'application est déployée en ligne sur un serveur avec Docker. Vous pouvez accéder à la <a href='https://innov-alc.angersloirecampus.fr/' target='_blank'>web app ici</a>.",
            "outils": [
                {"name": "VueJs"},
                {"name": "NodeJs"},
                {"name": "MYSQL"},
                {"name": "Docker"},
                {"name": "GIT"}
            ],
            "outil": "Liste des outils utilisés : ",
            "photos": [
                {"type": "img","src": "StageALC/accueil.jpg", "desc": "Page principale"},
                {"type": "img","src": "StageALC/coworking.jpg", "desc": "Exemple de fiches disponibles"},
                {"type": "img","src": "StageALC/gestion-data.jpg", "desc": "Gestion des données (admin)"},
                {"type": "img","src": "StageALC/gestion-outil-users.jpg", "desc": "Gestion des utilisateurs (admin)"},
                {"type": "img","src": "StageALC/gestion-outil-visits.jpg", "desc": "Graphique du nombre de visiteur"}
            ]
        },
        {
            "name": "Avion RC",
            "date": "Mars - Avril 2023",
            "intro": "Pour créer un avion radio-commandé, j'ai suivi un <a href='https://www.youtube.com/watch?v=cA379JRswz8' target='_blank'>projet</a> sur youtube. J'ai commencé par me munir un planeur en polystyrène. Je l'ai équipé d'un moteur, 2 servo-moteurs, 1 récepteur et une batterie pour le piloter.",
            "description": "Premier essai : 3 vols effectués d'une durée de 1 à 2 secondes. L'avion n'était pas assez équilibré pour être stable, et trop lourd, mais je m'en suis rendu compte plus tard.<br />2ème essai : 3 vols. Super équilibre mais poid de l'avion toujours trop lourd. J'ai donc décidé d'ajouter une deuxième aile sur le dessus. <br />3ème essaie, l'avion 'vol' quelques secondes. La 2ème aile à rendu l'avion moins stable, et le contôle est assez compliqué. Après un gros crash une aile s'est cassée... J'ai donc décidé de passer sur un modèle plus sérieux.",
            "photos": [
                {"src": "AvionRC1/avion-monoplan.jpg"},
                {"type": "img","src": "AvionRC1/avion-biplan.jpg"}
            ]    
        },
        {
            "name": "Avion RC V2",
            "date": "Avril 2023 - Juin 2023",
            "intro": "Nouvelle version d'avion radio-commandé, plus grand et en carton.",
            "description": "Pour ce projet, j'ai récupéré les plans d'un avion radiocommandé sur internet. J'ai commencé par coller les plans sur du carton afin de découper chaque pièce. Une fois les pièces découpées, j'ai suivi les étapes d'assemblage pour les coller et former l'avion. J'ai réutilisé certains composants de mon premier avion. <br />Avant de faire voler l'avion, j'ai effectué l'équilibrage et ai configuré ses composants. <br />Premiers vols : le moteur n'est pas assez puissant pour le gabarit de l'avion, et l'équilibrage peut être amélioré. Mais l'avion est plus robuste, et est plus facile à contrôler que le premier. <br />Pour la suite, j'ai donc mis un moteur plus puissant. L'avion ne volait pas vraiment mieux car les composants ne devait pas être adapté à son gabarit. Il a finit par se casser à force de chuter. <br />Pour le prochain modèle je vais faire un planeur afin de me concentrer sur la fabrication et le pilotage, sans contrainte de moteur.",
            "photos": [
                {"type": "img", "src": "AvionRC2/avion-carton.jpg"},
                {"type": "img", "src": "AvionRC2/plan-carton.jpg", "desc": "Plans de l'avion"}
            ],
            "video": [
                {"type": "video","src": "AvionRC2/vol-1.mp4"},
                {"type": "video","src": "AvionRC2/vol-2.mp4"}                
            ]
        },
        {
            "name": "Jeu web 3D",
            "date": "Juin 2023 - Juillet 2023",
            "intro": "Jeu zombie en web 3d",
            "description": "J'ai tenté faire un jeu sur le principe du mode zombie de BO2, sur navigateur, de façon très expérimentale. Pour cela j'ai utilisé VueJs, ce qui me permet de faire une web app. J'ai ensuite découvert et utilisé les frameworks ThreeJs pour la 3D, et AmmoJs pour ajouter une partie physique à l'environnement 3D. <br />J'ai commencé par faire un jeu de tire. Puis j'ai eu l'idée de faire un jeu de zombie, avec un système de manche qui fais spawns plus de zombies à chaques changement de manche. J'ai ensuite ajouté un chargeur avec un nombre de balles limités, la possibilité d'acheter des armes et des munitions sur les murs.<br /><a href='/zombie/' target='_blank'>Voici le jeu</a>. Jeu encore en développement, donc il y a pas mal de choses à améliorer.",
            "photos": [
                {"type": "img","src": "Zombie3D/gameplay-1.jpg"},
                {"type": "img","src": "Zombie3D/buy-weapon.jpg", "desc": "Possibilité d'acheter des armes en jeu"},
                {"type": "img","src": "Zombie3D/death-screen.jpg"}
            ],
            "outil": "Liste des outils utilisés : ",
            "outils": [
                {"name": "VueJs"},
                {"name": "ThreeJs"},
                {"name": "AmmoJs"}
            ]
        },
        {
            "name": "Stage Nimbus Center",
            "date": "Juillet 2023 - Novembre 2023",
            "intro": "Stage réalisé en Irelande. Le but de ce stage est de créer une combinaison de capture de mouvement, pour chevaux",
            "description": "Nous avons travaillé à deux sur ce projet. Nous avons utilisé des microcontrôleurs ESP32, avec des capteurs accéléromètre et gyroscope, afin de capturer des mouvements. Tous les microcontrôleurs étaient connectés en Wi-Fi à une base, une Raspberry. Cette base permet dans un premier temps, de sauvegarder les données sur une clé USB, ce qui facilite la visualisation ultérieure sur une application dédiée. Nous avons commencé à implémenter des méthodes pour visualiser en temps réel. Nous avons bien avancé sur cette partie, mais par manque de temps, elle n'est pas opérationnelle à 100%. Nous n'avons pas pu tester sur le cheval, mais les tests sur nous étaient concluants.",
            "photos": [
                {"type": "img","src": "StageNimbus/bat-horse.jpg", "desc": "Cheval avec la combinaison, pour les capteurs"},
                {"type": "img","src": "StageNimbus/esp32-seeed.jpg", "desc": "ESP32 utilisé"},
                {"type": "img","src": "StageNimbus/assemblage.jpg", "desc": "Boite 3D pour accueillir l'ESP, le capteur et la batterie"},
                {"type": "img","src": "StageNimbus/esp32.jpg", "desc": "ESP, soudé avec le capteur et la batterie"}
            ],    
            "outil": "Liste des outils utilisés : ",
            "outils": [
                {"name": "C++"},
                {"name": "ESP32"},
                {"name": "Solidworks"},
                {"name": "Raspberry"}
            ]
        },
        {
            "name": "Récepteur musique bluetooth",
            "date": "Janvier 2024 - Février 2024",
            "intro": "Le but de ce projet est de réaliser un module bluetooth pour écouter de la musique sur plusieurs enceintes en même temps.",
            "description": "J'ai utilisé un ESP32 pico kit qui sert de récepteur bluetooth. J'ai ensuite récupéré un code sur <a href='https://github.com/pschatzmann/ESP32-A2DP' target='_blank'>Github</a> qui permet de transformer le signal bluetooth, en signal analogique sur les pins de l'ESP32. Cela va permettre de 'transférer' la musique reçu en bluetooth, sur des connecteurs jack femelles. Je peux donc ensuite brancher des enceintes dessus, et avoir de la musique sur plusieurs appareils différents. Pour l'instant j'ai mis en place 2 connecteurs car cela me suffisait pour mon projet. ",
            "photos": [
                {"type": "img","src": "Esp32Musique/jack_and_usb.jpg", "desc": "Côté droite ESP32 : prise jack et cable d'alimentation"},
                {"type": "img","src": "Esp32Musique/jack.jpg", "desc": "Côté gauche : prise jack"},
                {"type": "img","src": "Esp32Musique/model.jpg", "desc": "Modélisation 3D de la boite"},
                {"type": "img","src": "Esp32Musique/inside.jpg", "desc": "Soudures entre l'ESP et les connecteurs jack"}
            ],    
            "outil": "Liste des outils utilisés : ",
            "outils": [
                {"name": "C++"},
                {"name": "ESP32"},
                {"name": "Solidworks"}
            ]
        },
        {
            "name": "FPS multijoueur",
            "date": "Novemmbre 2023 - Juillet 2024",
            "intro": "Pour ce projet j'ai voulu créer un jeu multijoueur sur navigateur",
            "description": "Les différents buts de ce proejts sont déjà d'améliorer le jeu de zombie, afin de jouer à plusieurs. Mais également de voir ce qui est possible ou non, en jeu sur navigateur. <br /><a href='/webfps/' target='_blank'>Voici le jeu</a> ",
            "photos": [
                {"type": "img","src": "FpsMulti/view_spawn.png", "desc": "Vue depuis le spawn"}
            ],  
            "outil": "Liste des outils utilisés : ",
            "outils": [
                {"name": "VueJs"},
                {"name": "NodeJs"},
                {"name": "ThreeJs"},
                {"name": "AmmoJs"}
            ]
        }
    ]
]
