[
    [
        {
            "welcome": "Welcome",
            "presentation1": "I'm Charles, a student in computer science",
            "presentation2": "On my portfolio, you'll find some projects",
            "loading1": "Loading photos",
            "loading2": "Enter"
        }
    ],[
        {
            "name": "4L Trophy",
            "date": "May 05 - 15, 2022",
            "intro": "Humanitarian rally aboard a Renault 4L",
            "description": "Rally using a 4L to deliver school and sports supplies to children in the desert. 900 teams of 2 at the start. 6000 km traveled between France, Spain, and Morocco. Adventure, mechanics, discovery!",
            "photos1": [
                {"type": "img","src": "Trophy/voiture-debut.jpg"},
                {"type": "img","src": "Trophy/voiture-moteur.jpg"},
                {"type": "img","src": "Trophy/village-depart.jpg"},
                {"type": "img","src": "Trophy/circuit.jpg"}
            ],
            "photos2": [
                {"type": "img","src": "Trophy/voiture-desert.jpg"},
                {"type": "img","src": "Trophy/voiture-palmier.jpg"},
                {"type": "img","src": "Trophy/voiture-sable.jpg"},
                {"type": "img","src": "Trophy/voiture-drapeau.jpg"}
            ]
        },
        {
            "name": "Internship at Citegestion (EDF)",
            "date": "May 23 - August 12, 2022",
            "intro": "Development of a web application for data visualization",
            "description": "The backend of the application retrieves data from the database on the number of interventions per equipment. The frontend displays the data in two different ways: the trend of a data or the correlation between two data sets. Users drag the data into boxes to initiate analysis. They can also choose the sampling frequency and date range. Options for single or multi-trend analysis over the chosen period.",
            "outils": [
                {"name": "Flask (Python)"},
                {"name": "VueJs"},
                {"name": "MYSQL"},
                {"name": "Docker"},
                {"name": "GIT"}
            ],
            "outil": "List of tools used: ",
            "photos1": [
                {"type": "img","src": "StageCitegestion/correlation-light-maquette.jpg"}
            ],
            "photos2": [
                {"type": "img","src": "StageCitegestion/correlation-dark.jpg"},
                {"type": "img","src": "StageCitegestion/tendance-light.jpg"}
            ]
        },
        {
            "name": "Jukebox",
            "date": "September 2022 - May 2023",
            "intro": "Creation of a jukebox, divided into two parts: a web application to view available CDs and choose one, and a 'machine' part (see model on the right), with a motor system and an electromagnet that positions the selected CD on the player.",
            "description": "A project that encompasses various domains: web development, electronics, mechanics, modeling, and project management. The web application is ready, and a significant portion of the component management code has been validated. I still need to build the object to begin testing movement. Also, I need to validate the 'grabbing' of the CD, placement on the wall, and player. <br />Project on hold due to an overseas internship that doesn't allow bringing the equipment. Resuming in November 2023.  <br /><a href='/jukebox/' target='_blank'>Demo</a> of the application is available, but not optimized for smartphones as the application will be displayed on a larger screen.",
            "photos1": [
                {"type": "img","src": "Jukebox/application-frontend.jpg"},
                {"type": "img","src": "Jukebox/application-frontend-play.jpg"},
                {"type": "img","src": "Jukebox/edit-cd.jpg"},
                {"type": "img","src": "Jukebox/lecteur.jpg"}
            ],
            "photos2": [
                {"type": "img","src": "Jukebox/modelisation-cote.jpg"},
                {"type": "img","src": "Jukebox/modelisation-face.jpg"}
            ]    
        },
        {
            "name": "Internship at Angers Loire Campus",
            "date": "March 06 - June 30, 2023",
            "intro": "Design of a web app for mapping innovation actors in Angers Loire Métropole",
            "description": "The application gathers information about the innovation field and displays it in categories containing sub-categories, which in turn contain individual profiles. There is an admin section for functional administrators (data and users). Security features include different role-based accounts. The app is deployed on a server using Docker. Link to the <a href='https://innov-alc.angersloirecampus.fr/' target='_blank'>web app</a>",
            "outils": [
                {"name": "NodeJs"},
                {"name": "VueJs"},
                {"name": "MYSQL"},
                {"name": "Docker"},
                {"name": "GIT"}
            ],
            "outil": "List of tools used: "
        },
        {
            "name": "Radio-Controlled Plane",
            "date": "March - April 2023",
            "intro": "For this project, I started by buying an EPP glider and equipped it with a motor, 2 servo motors, 1 receiver, and a battery for control.",
            "description": "First attempt: 3 flights lasting 1 to 2 seconds. The plane wasn't balanced enough to be stable and was too heavy, which I realized later. <br />Second attempt: 3 flights. Great balance but the plane still too heavy. So, I decided to add a second wing on top. <br />Third attempt, the plane 'flies' for a few seconds. The second wing made the plane less stable, and control was quite tricky, but it stayed in the air longer. After a major crash, one wing broke... So, I decided to move on to a more serious model.",
            "photos1": [
                {"src": "AvionRC1/avion-capot-ouvert.jpg"},
                {"src": "AvionRC1/avion-monoplan.jpg"}
            ],
            "photos2": [
                {"type": "img","src": "AvionRC1/avion-biplan.jpg"}
            ]   
        },
        {
            "name": "Radio-Controlled Plane V2",
            "date": "April 2023 - June 2023",
            "intro": "New version of a radio-controlled plane, larger and made of cardboard.",
            "description": "For this project, I obtained plans for a radio-controlled plane from the internet. I began by gluing the plans onto cardboard to cut out each piece. After cutting the pieces, I followed the assembly steps to glue them together and also reused some components from my previous plane. <br />Before flying it, I balanced the plane and configured its components. <br />Initial flights: the engine wasn't powerful enough for the plane's size, and the balance could be improved. However, the plane was more robust and easier to control than the first model. <br />For the next steps, I installed a more powerful engine, but it didn't significantly improve flight performance. It eventually broke due to multiple crashes. <br />For the next model, I'm planning to build a glider to focus on construction and flying without the motor constraint.",
            "photos1": [
                {"type": "img", "src": "AvionRC2/plan.jpg"},
                {"type": "img", "src": "AvionRC2/plan-carton.jpg"},
                {"type": "img", "src": "AvionRC2/avion-carton.jpg"}
            ],
            "video": [
                {"type": "video","src": "AvionRC2/vol-1.mp4"},
                {"type": "video","src": "AvionRC2/vol-2.mp4"}                
            ]
        },
        {
            "name": "3D Web Game",
            "date": "June 2023 - July 2023",
            "intro": "3D web zombie game",
            "description": "I attempted to recreate the zombie mode from BO2 (Call of Duty) in a browser. I used VueJs to create a web app and discovered and used the ThreeJs and AmmoJs frameworks for 3D and adding physics to the 3D environment. <a href='/zombie/'>Here's the app</a>. The game is still in development, so there are many things to adjust.",
            "photos1": [
                {"type": "img","src": "Zombie3D/gameplay-1.jpg"},
                {"type": "img","src": "Zombie3D/buy-weapon.jpg"}
            ],  
            "photos2": [
                {"type": "img","src": "Zombie3D/death-screen.jpg"}
            ],
            "outil": "List of tools used: ",
            "outils": [
                {"name": "VueJs"},
                {"name": "ThreeJs"},
                {"name": "AmmoJs"}
            ]
        },
        {
            "name": "Internship in Ireland: Horse Motion Capture",
            "date": "July 2023 - November 2023",
            "intro": "The goal of this internship is to capture horse movements for 3D display",
            "description": "For this project, there were two of us working together. We used ESP32s and accelerometer and gyroscope sensors to capture movements. Multiple ESPs were placed on the horse's joints to capture a wide range of movements. They were all connected via WiFi to another ESP32 serving as a base. The base sent all data as it arrived to an application for visualization and data storage.",
            "photos1": [
                {"type": "img","src": "MocapHorse/bat-horse.jpg"}
            ],  
            "photos2": [
                {"type": "img","src": "MocapHorse/esp32-seeed.jpg"}
            ],    
            "outil": "List of tools used: ",
            "outils": [
                {"name": "C++"},
                {"name": "ESP32"}
            ]
        }
    ]
]
