[
    [
        {
            "welcome": "Welcome",
            "presentation1": "I'm Charles, a student at ESEO, Angers, studying engineering.",
            "presentation2": "Here are some projects I've worked on in recent years.",
            "loading1": "Loading Photos",
            "loading2": "Enter"
        }
    ],
    [
        {
            "name": "4L Trophy",
            "date": "May 05 - 15, 2022",
            "intro": "Humanitarian rally aboard a Renault 4L.",
            "description": "Rally on board a 4L to deliver school and sports supplies to children in the desert. 900 teams of 2 at the start. 6,000 kilometers traveled across France, Spain, and Morocco. Adventure, mechanics, discovery!",
            "photos1": [
                {"type": "img","src": "Trophy/voiture-drapeau.jpg"},
                {"type": "img","src": "Trophy/voiture-moteur.jpg"},
                {"type": "img","src": "Trophy/village-depart.jpg"}
            ],
            "photos2": [
                {"type": "img","src": "Trophy/voiture-desert.jpg"},
                {"type": "img","src": "Trophy/voiture-palmier.jpg"},
                {"type": "img","src": "Trophy/voiture-sable.jpg"},
                {"type": "img","src": "Trophy/circuit.jpg"}
            ]
        },
        {
            "name": "Citegestion Internship",
            "date": "May 23 - August 12, 2022",
            "intro": "Development of a web application for data visualization at Citegestion, a subsidiary of EDF.",
            "description": "The application's backend retrieves data from the database regarding the number of interventions by equipment, per day, per week, per month, and more. The frontend displays the data in a chart in two different ways: the trend of a data point or the correlation between two data points. Users can drag the data point(s) into designated areas to launch an analysis. They can also choose the sampling frequency and date range. Simple or multi-trend analysis is possible over the selected period.",
            "outils": [
                {"name": "Flask (Python)"},
                {"name": "VueJs"},
                {"name": "MYSQL"},
                {"name": "Docker"},
                {"name": "GIT"}
            ],
            "outil": "List of tools used: ",
            "photos1": [
                {"type": "img","src": "StageCitegestion/correlation-light-maquette.jpg"}
            ],
            "photos2": [
                {"type": "img","src": "StageCitegestion/correlation-dark.jpg"},
                {"type": "img","src": "StageCitegestion/tendance-light.jpg"}
            ]
        },
        {
            "name": "Jukebox",
            "date": "September 2022 - May 2023",
            "intro": "Creation of a jukebox in two parts: a web application to view available CDs and select one, and a second part, a 'machine' (see model below), equipped with a system of motors and an electromagnet to take the desired CD and place it on the player.",
            "description": "This project encompasses several domains, including web development, electronics, mechanics, modeling, and project management. The web application is ready, and a significant portion of the component management code is validated. I have yet to build the object to commence movement tests and validate the 'CD retrieval' part, placement on the wall, and the player. <br> The project is on hold because an overseas internship does not allow for bringing the equipment on-site. A <a href='/jukebox/' target='_blank'>demonstration</a> of the application is available, but it is not optimized for smartphones since the application is intended for a dedicated screen.",
            "photos1": [
                {"type": "img","src": "Jukebox/application-frontend.jpg"},
                {"type": "img","src": "Jukebox/application-frontend-play.jpg"},
                {"type": "img","src": "Jukebox/edit-cd.jpg"},
                {"type": "img","src": "Jukebox/lecteur.jpg"}
            ],
            "photos2": [
                {"type": "img","src": "Jukebox/modelisation-cote.jpg"},
                {"type": "img","src": "Jukebox/modelisation-face.jpg"}
            ]  
        },
        {
            "name": "ALC Internship",
            "date": "March 06 - June 30, 2023",
            "intro": "Design of a web app for mapping innovation actors in Angers Loire Metropole, for Angers Loire Campus.",
            "description": "The application consolidates information in the innovation domain, organized into categories containing subcategories, which in turn contain detailed records. It incorporates application management functionality accessible to functional administrators (data and app users). Security is ensured through various admin accounts. The application is deployed online on a server using Docker. You can access the <a href='https://innov-alc.angersloirecampus.fr/' target='_blank'>web app here</a>.",
            "outils": [
                {"name": "VueJs"},
                {"name": "NodeJs"},
                {"name": "MYSQL"},
                {"name": "Docker"},
                {"name": "GIT"}
            ],
            "outil": "List of tools used: ",
            "photos1": [
                {"type": "img","src": "StageALC/accueil.jpg"},
                {"type": "img","src": "StageALC/coworking.jpg"}
            ],  
            "photos2": [
                {"type": "img","src": "StageALC/gestion-data.jpg"},
                {"type": "img","src": "StageALC/gestion-outil-users.jpg"},
                {"type": "img","src": "StageALC/gestion-outil-visits.jpg"}
            ]
        },
        {
            "name": "RC Plane",
            "date": "March - April 2023",
            "intro": "For this project, I started by purchasing a polystyrene glider. I equipped it with a motor, 2 servo motors, 1 receiver, and a battery to control it.",
            "description": "First attempt: 3 flights, each lasting 1 to 2 seconds. The plane was not balanced enough to be stable and was too heavy, but I realized this later. Second attempt: 3 flights. Excellent balance, but the plane was still too heavy. I decided to add a second wing on top. Third attempt, the plane 'flies' for a few seconds. The second wing made the plane less stable, and control was quite challenging. After a major crash, one wing broke. So I decided to move on to a more serious model.",
            "photos1": [
                {"src": "AvionRC1/avion-monoplan.jpg"}
            ],
            "photos2": [
                {"type": "img","src": "AvionRC1/avion-biplan.jpg"}
            ]  
        },
        {
            "name": "RC Plane V2",
            "date": "April 2023 - June 2023",
            "intro": "New version of a radio-controlled plane, larger and made of cardboard.",
            "description": "For this project, I obtained plans for a radio-controlled plane from the internet. I started by gluing the plans to cardboard to cut out each piece. Once the pieces were cut out, I followed the assembly steps to glue them together and form the plane. I reused some components from my first plane. Before flying the plane, I balanced it and configured its components. Initial flights: the motor was not powerful enough for the size of the plane, and the balance could be improved. But the plane was more robust and easier to control than the first. For the next model, I will make a glider to focus on manufacturing and piloting, without the constraints of a motor.",
            "photos1": [
                {"type": "img", "src": "AvionRC2/avion-carton.jpg"},
                {"type": "img", "src": "AvionRC2/plan-carton.jpg"}
            ],
            "video": [
                {"type": "video","src": "AvionRC2/vol-1.mp4"},
                {"type": "video","src": "AvionRC2/vol-2.mp4"}                
            ]
        },
        {
            "name": "3D Web Game",
            "date": "June 2023 - July 2023",
            "intro": "3D web zombie game.",
            "description": "I attempted to recreate the zombie mode from BO2 (Call of Duty) in a web browser. For this, I used VueJs, enabling me to create a web app. I also discovered and used the ThreeJs and AmmoJs frameworks to add physics to the 3D environment. <a href='/zombie/' target='_blank'>Here's the app</a>. The game is still in development, so there are many things to improve.",
            "photos1": [
                {"type": "img","src": "Zombie3D/gameplay-1.jpg"},
                {"type": "img","src": "Zombie3D/buy-weapon.jpg"}
            ],  
            "photos2": [
                {"type": "img","src": "Zombie3D/death-screen.jpg"}
            ],
            "outil": "List of tools used: ",
            "outils": [
                {"name": "VueJs"},
                {"name": "ThreeJs"},
                {"name": "AmmoJs"}
            ]
        },
        {
            "name": "Nimbus Center Internship",
            "date": "July 2023 - November 2023",
            "intro": "Internship carried out in Ireland. The goal of this internship is to create a motion capture suit for horses.",
            "description": "For this project, we were a team of two. We used ESP32 microcontrollers in combination with accelerometer and gyroscope sensors to capture motion. Several ESP32s were placed on the horse's joints to collect a wide range of motion data. All microcontrollers were connected via Wi-Fi to a central unit, another ESP32, which played a basic role. This central unit transmitted all collected data in real-time to a dedicated application. This application allowed real-time data visualization and storage for later analysis.",
            "photos1": [
                {"type": "img","src": "StageNimbus/bat-horse.jpg"}
            ],  
            "photos2": [
                {"type": "img","src": "StageNimbus/esp32-seeed.jpg"},
                {"type": "img","src": "StageNimbus/assemblage.jpg"},
                {"type": "img","src": "StageNimbus/esp32.jpg"}
            ],    
            "outil": "List of tools used: ",
            "outils": [
                {"name": "C++"},
                {"name": "ESP32"},
                {"name": "Raspberry Pi"}
            ]
        }
    ]
]
