[
    [
        {
            "welcome": "Bienvenue",
            "presentation1": "Je suis Charles, étudiant en école d'ingénieur à l'ESEO, Angers",
            "presentation2": "Voici quelques projets réalisé ces dernières années",
            "loading1": "Chargement des photos",
            "loading2": "Entrer"
        }
    ],[
        {
            "name": "4L Trophy",
            "date": "05 - 15 mai 2022",
            "intro": "Raid humanitaire à bord d'une Renault 4L.",
            "description": "Raid à bord d'une 4L pour acheminer des fournitures scolaires et sportives aux enfants du désert. 900 équipages de 2 au départ. 6 000 km parcourus entre la France, l'Espagne et le Maroc. Aventure, mécanique, découverte !",
            "photos1": [
                {"type": "img","src": "Trophy/voiture-drapeau.jpg"},
                {"type": "img","src": "Trophy/voiture-moteur.jpg"},
                {"type": "img","src": "Trophy/village-depart.jpg"}
            ],
            "photos2": [
                {"type": "img","src": "Trophy/voiture-desert.jpg"},
                {"type": "img","src": "Trophy/voiture-palmier.jpg"},
                {"type": "img","src": "Trophy/voiture-sable.jpg"},
                {"type": "img","src": "Trophy/circuit.jpg"}
            ]
        },
        {
            "name": "Stage Citegestion",
            "date": "23 mai - 12 aout 2022",
            "intro": "Développement d'une application web de visualisation de données chez Citegestion, filiale d'EDF.",
            "description": "Le backend de l'application récupère des données en base de données sur le nombre d'interventions par équipement, par jour, par semaine, par mois, etc. Le frontend affiche les données dans un graphique de deux manières différentes : la tendance d'une donnée ou la corrélation entre deux données. L'utilisateur glisse la/les donnée(s) dans des cases pour lancer une analyse. Il peut également choisir la fréquence d'échantillonnage et la plage de dates. Possibilité de tendance simple ou multi-tendance sur la période choisie.",                      
            "outils": [
                {"name": "Flask (Python)"},
                {"name": "VueJs"},
                {"name": "MYSQL"},
                {"name": "Docker"},
                {"name": "GIT"}
            ],
            "outil": "Liste des outils utilisés : ",
            "photos1": [
                {"type": "img","src": "StageCitegestion/correlation-light-maquette.jpg"}
            ],
            "photos2": [
                {"type": "img","src": "StageCitegestion/correlation-dark.jpg"},
                {"type": "img","src": "StageCitegestion/tendance-light.jpg"}
            ]
        },
        {
            "name": "Jukebox",
            "date": "septembre 2022 - mai 2023",
            "intro": "Création d'un jukebox en deux parties : une application web pour voir les CD disponibles et en choisir un. Une deuxième partie, une \"machine\" (voir modèle ci-dessous), équipée d'un système de moteurs et d'un électroaimant, qui prend le CD voulu et le place sur le lecteur.",
            "description": "Ce projet regroupe plusieurs domaines, dont le développement web, l'électronique, la mécanique, la modélisation et la gestion de projet. L'application web est prête, une bonne partie du code de gestion des composants est validée. Il me reste à construire l'objet pour commencer les tests de déplacement, ainsi qu'à valider la partie 'prise' du CD, le placement sur le mur et le lecteur. <br> Le projet est en pause car un stage à l'étranger ne permet pas d'amener le matériel sur place. Une <a href='/jukebox/' target='_blank'>démonstration</a> de l'application est disponible, mais elle n'est pas adaptée aux smartphones car l'application sera sur un écran dédié.",
            "photos1": [
                {"type": "img","src": "Jukebox/application-frontend.jpg"},
                {"type": "img","src": "Jukebox/application-frontend-play.jpg"},
                {"type": "img","src": "Jukebox/edit-cd.jpg"},
                {"type": "img","src": "Jukebox/lecteur.jpg"}
            ],
            "photos2": [
                {"type": "img","src": "Jukebox/modelisation-cote.jpg"},
                {"type": "img","src": "Jukebox/modelisation-face.jpg"}
            ]    
        },
        {
            "name": "Stage ALC ",
            "date": "06 mars 2023 - 30 juin 2023",
            "intro": "Conception d'une web app de cartographie des acteurs de l'innovation sur Angers Loire Métropole, pour Angers Loire Campus",
            "description": "L'application regroupe des informations sur le domaine de l'innovation, organisées en catégories contenant des sous-catégories, elles-mêmes contenant des fiches détaillées. Elle intègre une fonctionnalité de gestion de l'application, accessible aux administrateurs (gestion des données et des utilisateurs). La sécurité est assurée grâce à des comptes administrateurs. L'application est déployée en ligne sur un serveur avec Docker. Vous pouvez accéder à la <a href='https://innov-alc.angersloirecampus.fr/' target='_blank'>web app ici</a>.",
            "outils": [
                {"name": "NodeJs"},
                {"name": "VueJs"},
                {"name": "MYSQL"},
                {"name": "Docker"},
                {"name": "GIT"}
            ],
            "outil": "Liste des outils utilisés : ",
            "photos1": [
                {"type": "img","src": "StageALC/accueil.jpg"},
                {"type": "img","src": "StageALC/coworking.jpg"}
            ],  
            "photos2": [
                {"type": "img","src": "StageALC/gestion-data.jpg"},
                {"type": "img","src": "StageALC/gestion-outil-users.jpg"},
                {"type": "img","src": "StageALC/gestion-outil-visits.jpg"}
            ]
        },
        {
            "name": "Avion RC",
            "date": "Mars - Avril 2023",
            "intro": "Pour ce projet, j'ai commencé par acheter un planeur en polystyrène. Je l'ai équipé d'un moteur, 2 servo-moteurs, 1 récepteur et une batterie pour le piloter.",
            "description": "Premier essai : 3 vols effectués d'une durée de 1 à 2 secondes. L'avion n'était pas assez équilibré pour être stable, et trop lourd, mais je m'en suis rendu compte plus tard.<br />2ème essai : 3 vols. Super équilibre mais poid de l'avion toujours trop lourd. J'ai donc décidé d'ajouter une deuxième aile sur le dessus. <br />3ème essaie, l'avion 'vol' quelques secondes. La 2ème aile à rendu l'avion moins stable, et le contôle est assez compliqué. Après un gros crash une aile s'est cassée... J'ai donc décidé de passer sur un modèle plus sérieux.",
            "photos1": [
                {"src": "AvionRC1/avion-monoplan.jpg"}
            ],
            "photos2": [
                {"type": "img","src": "AvionRC1/avion-biplan.jpg"}
            ]    
        },
        {
            "name": "Avion RC V2",
            "date": "Avril 2023 - Juin 2023",
            "intro": "Nouvelle version d'avion radio-commandé, plus grand et en carton.",
            "description": "Pour ce projet, j'ai récupéré les plans d'un avion radiocommandé sur internet. J'ai commencé par coller les plans sur du carton afin de découper chaque pièce. Une fois les pièces découpées, j'ai suivi les étapes d'assemblage pour les coller et former l'avion. J'ai réutilisé certains composants de mon premier avion. <br />Avant de faire voler l'avion, j'ai effectué l'équilibrage et ai configuré ses composants. <br />Premiers vols : le moteur n'est pas assez puissant pour le gabarit de l'avion, et l'équilibrage peut être amélioré. Mais l'avion est plus robuste, et est plus facile à contrôler que le premier. <br />Pour la suite, j'ai donc mis un moteur plus puissant. L'avion ne volait pas vraiment mieux car les composants ne devait pas être adapté à son gabarit. Il a finit par se casser à force de chuter. <br />Pour le prochain modèle je vais faire un planeur afin de me concentrer sur la fabrication et le pilotage, sans contrainte de moteur.",
            "photos1": [
                {"type": "img", "src": "AvionRC2/avion-carton.jpg"},
                {"type": "img", "src": "AvionRC2/plan-carton.jpg"}
            ],
            "video": [
                {"type": "video","src": "AvionRC2/vol-1.mp4"},
                {"type": "video","src": "AvionRC2/vol-2.mp4"}                
            ]
        },
        {
            "name": "Jeu web 3D",
            "date": "Juin 2023 - Juillet 2023",
            "intro": "Jeu zombie en web 3d",
            "description": "J'ai tenté de reproduire le mode zombie de BO2 (Call of duty) sur navigateur. Pour cela j'ai utilisé VueJs, ce qui me permet de faire une web app. J'ai ensuite découvert et utilisé les frameworks ThreeJs pour la 3D, et AmmoJs pour ajouter une partie physique à l'environnement 3D. <a href='/zombie/' target='_blank'>Voici l'app</a>. Jeu encore en développement, donc il y a pas mal de choses à améliorer.",
            "photos1": [
                {"type": "img","src": "Zombie3D/gameplay-1.jpg"},
                {"type": "img","src": "Zombie3D/buy-weapon.jpg"}
            ],  
            "photos2": [
                {"type": "img","src": "Zombie3D/death-screen.jpg"}
            ],
            "outil": "Liste des outils utilisés : ",
            "outils": [
                {"name": "VueJs"},
                {"name": "ThreeJs"},
                {"name": "AmmoJs"}
            ]
        },
        {
            "name": "Stage Nimbus Center",
            "date": "Juillet 2023 - Novembre 2023",
            "intro": "Stage réalisé en Irelande. Le but de ce stage est de créer une combinaison de capture de mouvement, pour chevaux",
            "description": "Pour ce projet, nous étions une équipe de deux personnes. Nous avons utilisé des microcontrôleurs ESP32 en combinaison avec des capteurs d'accéléromètre et de gyroscope pour capturer les mouvements. Plusieurs ESP32 ont été positionnés sur les articulations du cheval afin de recueillir un large éventail de données de mouvement. Tous les microcontrôleurs étaient connectés en Wi-Fi à une unité centrale, un autre ESP32, qui jouait un rôle de base. Cette unité centrale a transmis en temps réel toutes les données collectées vers une application dédiée. Cette application permettait de visualiser les données en temps réel et de les sauvegarder pour une analyse ultérieure.",
            "photos1": [
                {"type": "img","src": "StageNimbus/bat-horse.jpg"}
            ],  
            "photos2": [
                {"type": "img","src": "StageNimbus/esp32-seeed.jpg"},
                {"type": "img","src": "StageNimbus/assemblage.jpg"},
                {"type": "img","src": "StageNimbus/esp32.jpg"}
            ],    
            "outil": "Liste des outils utilisés : ",
            "outils": [
                {"name": "C++"},
                {"name": "ESP32"},
                {"name": "Raspberry"}
            ]
        }
    ]
]
